In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv("/home/csl-4/Downloads/train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
categorical_var = "Pclass"   # ticket class
numeric_vars = ["Age", "Fare"]

In [6]:
df[numeric_vars] = df[numeric_vars].fillna(df[numeric_vars].median())

In [7]:
df[categorical_var] = df[categorical_var].fillna(df[categorical_var].mode()[0])

In [8]:
df[numeric_vars].describe()

              Age        Fare
count  891.000000  891.000000
mean    29.361582   32.204208
std     13.019697   49.693429
min      0.420000    0.000000
25%     22.000000    7.910400
50%     28.000000   14.454200
75%     35.000000   31.000000
max     80.000000  512.329200

In [9]:
grouped_stats = df.groupby(categorical_var)[numeric_vars].agg(
    ["mean", "median", "min", "max", "std"]
)
grouped_stats

              Age                                     Fare                \
             mean median   min   max        std       mean   median  min
Pclass
1       36.812130   35.0  0.92  80.0  14.182103  84.154687  60.2875  0.0
2       29.765380   28.0  0.67  70.0  13.581096  20.662183  14.2500  0.0
3       25.932627   28.0  0.42  74.0  10.697676  13.675550   8.0500  0.0


             max        std
Pclass
1       512.3292  78.380373
2        73.5000  13.417399
3        69.5500  11.778142

In [10]:
grouped_stats.columns = [
    f"{col}_{stat}" for col, stat in grouped_stats.columns
]

grouped_stats

,Age_mean,Age_median,Age_min,Age_max,Age_std,Fare_mean,Fare_median,Fare_min,Fare_max,Fare_std
Pclass,,,,,,,,,,
1,36.812130,35.0,0.92,80.0,14.182103,84.154687,60.2875,0.0,512.3292,78.380373
2,29.765380,28.0,0.67,70.0,13.581096,20.662183,14.2500,0.0,73.5000,13.417399
3,25.932627,28.0,0.42,74.0,10.697676,13.675550,8.0500,0.0,69.5500,11.778142

In [11]:
for var in numeric_vars:
    print(f"\nSummary of {var} grouped by {categorical_var}:")
    print(df.groupby(categorical_var)[var].describe())

Summary of Age grouped by Pclass:
        count       mean        std   min    25%   50%    75%   max
Pclass
1       216.0  36.812130  14.182103  0.92  28.00  35.0  47.25  80.0
2       184.0  29.765380  13.581096  0.67  23.00  28.0  36.00  70.0
3       491.0  25.932627  10.697676  0.42  20.25  28.0  29.00  74.0

Summary of Fare grouped by Pclass:
        count       mean        std  min       25%      50%   75%       max
Pclass
1       216.0  84.154687  78.380373  0.0  30.92395  60.2875  93.5  512.3292
2       184.0  20.662183  13.417399  0.0  13.00000  14.2500  26.0   73.5000
3       491.0  13.675550  11.778142  0.0   7.75000   8.0500  15.5   69.5500

In [12]:
age_list_by_class = df.groupby(categorical_var)["Age"].apply(list)
fare_list_by_class = df.groupby(categorical_var)["Fare"].apply(list)

print("Age lists by class:\n", age_list_by_class)
print("\nFare lists by class:\n", fare_list_by_class)

Age lists by class:
 Pclass
1    [38.0, 35.0, 54.0, 58.0, 28.0, 19.0, 40.0, 28....
2    [14.0, 55.0, 28.0, 35.0, 34.0, 66.0, 27.0, 3.0...
3    [22.0, 26.0, 35.0, 28.0, 2.0, 27.0, 4.0, 20.0,...
Name: Age, dtype: object

Fare lists by class:
 Pclass
1    [71.2833, 53.1, 51.8625, 26.55, 35.5, 263.0, 2...
2    [30.0708, 16.0, 13.0, 26.0, 13.0, 10.5, 21.0, ...
3    [7.25, 7.925, 8.05, 8.4583, 21.075, 11.1333, 1...
Name: Fare, dtype: object

In [13]:
# Iris

In [20]:
# Load Iris dataset 
data = pd.read_csv('/home/csl-4/Downloads/Iris.csv')  

# Display 
data.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [21]:
# Check the column names
print(data.columns)

# Clean any extra spaces in column names if needed
data.columns = data.columns.str.strip()

print(data.columns)

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')
Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [22]:
# Filter
setosa = data[data['Species'] == 'Iris-setosa']
versicolor = data[data['Species'] == 'Iris-versicolor']
virginica = data[data['Species'] == 'Iris-virginica']

In [24]:
# Function to calculate and display statistics (mean, std, percentiles) 
def display_statistics(species_data, species_name):
    print(f"\nStatistics for {species_name}:")
    print(f"Mean:")
    print(species_data.mean())
    print(f"\nStandard Deviation:")
    print(species_data.std())
    print(f"\nPercentiles:")
    print(f"25th Percentile: {np.percentile(species_data, 25)}")
    print(f"50th Percentile (Median): {np.percentile(species_data, 50)}")
    print(f"75th Percentile: {np.percentile(species_data, 75)}")

In [25]:
# Displaying for Iris-setosa
display_statistics(setosa.drop(columns=['Id', 'Species']), 'Iris-setosa')

# Displaying for Iris-versicolor
display_statistics(versicolor.drop(columns=['Id', 'Species']), 'Iris-versicolor')

# Displaying for Iris-virginica
display_statistics(virginica.drop(columns=['Id', 'Species']), 'Iris-virginica')

Statistics for Iris-setosa:
Mean:
SepalLengthCm    5.006
SepalWidthCm     3.418
PetalLengthCm    1.464
PetalWidthCm     0.244
dtype: float64

Standard Deviation:
SepalLengthCm    0.352490
SepalWidthCm     0.381024
PetalLengthCm    0.173511
PetalWidthCm     0.107210
dtype: float64

Percentiles:
25th Percentile: 0.9
50th Percentile (Median): 2.0999999999999996
75th Percentile: 4.325

Statistics for Iris-versicolor:
Mean:
SepalLengthCm    5.936
SepalWidthCm     2.770
PetalLengthCm    4.260
PetalWidthCm     1.326
dtype: float64

Standard Deviation:
SepalLengthCm    0.516171
SepalWidthCm     0.313798
PetalLengthCm    0.469911
PetalWidthCm     0.197753
dtype: float64

Percentiles:
25th Percentile: 1.95
50th Percentile (Median): 3.3
75th Percentile: 5.0

Statistics for Iris-virginica:
Mean:
SepalLengthCm    6.588
SepalWidthCm     2.974
PetalLengthCm    5.552
PetalWidthCm     2.026
dtype: float64

Standard Deviation:
SepalLengthCm    0.635880
SepalWidthCm     0.322497
PetalLengthCm    0.551895
PetalWidthCm     0.274650
dtype: float64

Percentiles:
25th Percentile: 2.5
50th Percentile (Median): 4.15
75th Percentile: 6.025